controltheory/beamer/3/3_3_ess.org
# +LaTeX_CLASS:  article
#+LATEX_HEADER: \usepackage{etex}
#+LATEX_HEADER: \usepackage{amsmath}
 # +LATEX_HEADER: \usepackage[usenames]{color}
#+LATEX_HEADER: \usepackage{pstricks}
#+LATEX_HEADER: \usepackage{pgfplots}
#+LATEX_HEADER: \usepackage{tikz}
#+LATEX_HEADER: \usepackage[europeanresistors,americaninductors]{circuitikz}
#+LATEX_HEADER: \usepackage{colortbl}
#+LATEX_HEADER: \usepackage{yfonts}
#+LATEX_HEADER: \usetikzlibrary{shapes,arrows}
#+LATEX_HEADER: \usetikzlibrary{positioning}
#+LATEX_HEADER: \usetikzlibrary{arrows,shapes}
#+LATEX_HEADER: \usetikzlibrary{intersections}
#+LATEX_HEADER: \usetikzlibrary{calc,patterns,decorations.pathmorphing,decorations.markings}
#+LATEX_HEADER: \usepackage[BoldFont,SlantFont,CJKchecksingle]{xeCJK}
#+LATEX_HEADER: \setCJKmainfont[BoldFont=Evermore Hei]{Evermore Kai}
#+LATEX_HEADER: \setCJKmonofont{Evermore Kai}
 # +LATEX_HEADER: \xeCJKsetup{CJKglue=\hspace{0pt plus .08 \baselineskip }}
#+LATEX_HEADER: \usepackage{pst-node}
#+LATEX_HEADER: \usepackage{pst-plot}
#+LATEX_HEADER: \psset{unit=5mm}
#+LATEX_HEADER: \newcommand*\diff{\mathop{}\!\mathrm{d}}
#+LATEX_HEADER: \allowdisplaybreaks
#+LATEX_HEADER:\usepackage{polynom}


#+startup: beamer
#+LaTeX_CLASS: beamer
# +LaTeX_CLASS_OPTIONS: [bigger]
 # +latex_header:  \usepackage{beamerarticle}
# +latex_header: \mode<beamer>{\usetheme{JuanLesPins}}
# +latex_header: \mode<beamer>{\usetheme{Boadilla}}
#+latex_header: \mode<beamer>{\usetheme{Frankfurt}}
#+latex_header: \mode<beamer>{\usecolortheme{dove}}
#+latex_header: \mode<article>{\hypersetup{colorlinks=true,pdfborder={0 0 0}}}
#+latex_header: \mode<beamer>{\AtBeginSection[]{\begin{frame}<beamer>\frametitle{Topic}\tableofcontents[currentsection]\end{frame}}}
#+latex_header: \setbeamercovered{transparent}
#+BEAMER_FRAME_LEVEL: 2
#+COLUMNS: %40ITEM %10BEAMER_env(Env) %9BEAMER_envargs(Env Args) %4BEAMER_col(Col) %10BEAMER_extra(Extra)

#+TITLE:  线性系统时域分析法
#+latex_header: \subtitle{系统的稳态误差计算}
#+AUTHOR:    
#+EMAIL: 
#+DATE:  
#+DESCRIPTION:
#+KEYWORDS:
#+LANGUAGE:  en
#+OPTIONS:   H:3 num:t toc:t \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:nil toc:nil ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:   
#+LINK_HOME: 
#+XSLT:











* 误差传递函数
** 系统误差
*** ignore					      :BMCOL:B_ignoreheading:
     :PROPERTIES:
     :BEAMER_col: 0.5
     :BEAMER_env: ignoreheading
     :END:
\begin{psmatrix}[rowsep=0.4,colsep=0.5]
%              
%         E(s) .------.
% R-->o----- ->| G(s) |--+--> C
%   _ ^        '------'  |
%     |                  |  
%     '--------[ H(s) ]--'
%
%
% 1                        2                        3             4              5    6
$R(s)$ &  \pscirclebox[framesep=-0.2em]{$\times$} &$\cdots $   &  \psframebox{$G(s)$}   &   & $C(s)$ \\
       &                                          &       &  \psframebox{$H(s)$}&  &        \\
%link
\ncline{->}{1,1}{1,2}
\ncline{->}{1,2}{1,4}
\naput{$E(s)$}
\ncline{->}{1,4}{1,6}
\ncangle[angleA=0,angleB=0,armA=0.5em,armB=0.5em]{1,4}{2,4}
\ncangle[angleA=180,angleB=-90,armA=0.5em,armB=1em]{->}{2,4}{1,2}
\naput[npos=2.3]{$-$}
\end{psmatrix}

\mode<article>{系统误差有两种:}

 * <2->输入端定义:$E_{2}(s)=E(s)$
 * <3->输出端定义:$E_{1}(s)=C_{expect}-C_{real}$
 * <4->不加特别说明,系统误差指的是输入端定义.

*** $E(s)$ 与 $E_1(s)$					      :BMCOL:B_block:
     :PROPERTIES:
     :BEAMER_col: 0.5
     :BEAMER_env: block
     :BEAMER_envargs: <5->
     :END:

\begin{eqnarray*}
C_{expect} & = & \frac{R(s)}{H(s)}\\
E_{1}(s)   & = & \frac{R(s)}{H(s)}-C(s) \\
           & = & \frac{R(s)-C(s)H(s)}{H(s)}\\
           & =& \frac{E(s)}{H(s)}
\end{eqnarray*}

** 误差传递函数:
\begin{eqnarray*}
\Phi_{e}(s) & = & \frac{E(s)}{R(s)}\\
            & = & \frac{1}{1+G(s)H(s)} \\
            & = & \frac{R(s)-H(s)C(s)}{R(s)} \\
            & = & 1-H(s)\Phi(s)
\end{eqnarray*}

 * <2-> 系统误差:$E(s)=\Phi_{e}(s)R(s)$

** 稳态误差:
\begin{eqnarray*}
e_{ss} &=& \lim_{t\rightarrow \infty}e(t) \\
       &=& \lim_{s\rightarrow 0}sE(s)  \\
       &= & \lim_{s\rightarrow 0}s\Phi_{e}(s)R(s)
\end{eqnarray*}

    * <2->稳态误差与输入信号有关
    * <3->求稳态误差前要判断系统稳定性

** 扰动作用下的稳态误差
\begin{psmatrix}[rowsep=0.4,colsep=0.5]
%          1    2  3     4    5    6    7 
%                            | N(s)
%               E(s)         v +  
%         R---->o--> G_1(s)--o- G_2(s)--+--> C
%             _ ^                       |
%               |                       |  
%               '-----------H(s)--------+
%           
%
% 1                         2                           3                  4                     5
       &                                       &               &                        &         $N(s)$                                  &   \\  
$R(s)$  &\pscirclebox[framesep=-0.2em]{$\times$}& {\hskip 1em} &  \psframebox{$G_1(s)$} &  \pscirclebox[framesep=-0.2em]{$\times$} &  \psframebox{$G_2(s)$}  & \    & $C(s)$ \\
       &                                         &              &     &   \psframebox{$ H(s) $} 
%link
\ncline{->}{1,5}{2,5}
%\naput{$N(s)$}
\ncline{->}{2,1}{2,2}
\ncline{->}{2,2}{2,4}
\naput{$E(s)$}
\ncline{->}{2,4}{2,5}
\ncline{->}{2,5}{2,6}
\ncline{->}{2,6}{2,8}
\ncangles[angleA=180,angleB=0,armA=0em,armB=0em]{->}{2,7}{3,5}
\ncangle[angleA=180,angleB=-90,armA=0em,armB=0em]{->}{3,5}{2,2}
\naput[npos=1.6]{$-$}
\end{psmatrix}

*** 输入端定义:						      :BMCOL:B_block:
     :PROPERTIES:
     :BEAMER_col: 0.5
     :BEAMER_env: block
     :BEAMER_envargs: <2->
     :END:

\begin{eqnarray*}
E(s) & = &E_R(s)+E_N(s) \\
E_R(s)&=& \Phi_e(s)R(s) \\
E_N(s)&=& \Phi_{en}(s)N(s) \\
\end{eqnarray*}

*** 输出端定义:						      :BMCOL:B_block:
     :PROPERTIES:
     :BEAMER_col: 0.5
     :BEAMER_env: block
     :BEAMER_envargs: <3->
     :END:
令 $R(s)=0$ ,计算 $N(s)$ 单独引起的 $e_{ss}$ ,此时 $C_{expect}(s)=0$ 

\begin{eqnarray*}
E(s) & = & 0-C(s) \\
     & = & -\Phi_N(s)N(s)\\
\Phi_N(s) &=& \frac{G_2}{1+G_1G_2}\\
e_{ss}&=&\lim_{s\rightarrow 0}s(-\Phi_N(s)N(s)) 
\end{eqnarray*}

* 系统类型与静态误差系数
** 阶跃输入:
\begin{eqnarray*}
r(t) & = & A \\
R(s) & = & \frac{A}{s} \\
e_{ss}&=& \lim_{s\rightarrow 0}s \cdot\frac{1}{1+G_{open}(s)}\cdot\frac{A}{s} \\
      &=& \lim_{s\rightarrow 0}\frac{A}{1+G_{open}(s)}
\end{eqnarray*}

** 速度输入
\begin{eqnarray*}
r(t) & = & vt \\
R(s) & = & \frac{v}{s^{2}} \\
e_{ss}&=& \lim_{s\rightarrow 0}s \cdot\frac{1}{1+G_{open}(s)}\cdot\frac{v}{s^{2}} \\
      &=& \lim_{s\rightarrow 0}\frac{A}{s+sG_{open}(s)}\\
      &=& \lim_{s\rightarrow 0}\frac{A}{sG_{open}(s)}
\end{eqnarray*}

** 加速度输入
\begin{eqnarray*}
r(t) & = & \frac{1}{2}at^{2} \\
R(s) & = & \frac{a}{s^{2}} \\
e_{ss}&=& \lim_{s\rightarrow 0}s \cdot\frac{1}{1+G_{open}(s)}\cdot\frac{a}{s^{3}} \\
      &=& \lim_{s\rightarrow 0}\frac{A}{s^{2}+s^{2}G_{open}(s)}\\
      &=& \lim_{s\rightarrow 0}\frac{A}{s^{2}G_{open}(s)}
\end{eqnarray*}

** 系统类型
 * <2->由开环传递函数定义
     \begin{eqnarray*}
      G_{open} & = & G(s)H(s) \\
	       & = & \frac{K\prod_{i=1}^{m}(\tau_{i}s+1)}{s^{\nu}\prod_{j=1}^{n-\nu}(T_{j}s+1)}
     \end{eqnarray*}
 * <2->其中 $K$ 为开环增益.
 * <3->定义:
   * $\nu=0$ 称为0型系统
   * $\nu=1$ 称为I型系统
   * $\nu=2$ 称为II型系统

** 静态误差系数
 *  <2->静态位置误差系数
       \begin{eqnarray*}
       r(t) &=& A\\
       e_{ss}&=&\frac{A}{1+K_{p}}, \qquad
       K_{p}=\lim_{s\rightarrow 0} G_{open}(s)
       \end{eqnarray*}
 *  <3->静态速度误差系数 
       \begin{eqnarray*}
       r(t)&=&vt\\
       e_{ss}&=&\frac{v}{K_{v}}, \qquad
       K_{v}=\lim_{s\rightarrow 0} sG_{open}(s)
       \end{eqnarray*}
 *  <4->静态加速度误差系数 
       \begin{eqnarray*}
       r(t)&=&\frac{1}{2}at^{2}\\
       e_{ss}&=&\frac{a}{K_{a}}, \qquad
       K_{a}=\lim_{s\rightarrow 0} s^{2}G_{open}(s)
       \end{eqnarray*}
