controltheory/beamer/3/3_3_ess.tex
% Created 2014-10-11 星期六 12:06
\documentclass{beamer}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{soul}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{latexsym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage{etex}
\usepackage{amsmath}
\usepackage{pstricks}
\usepackage{pgfplots}
\usepackage{tikz}
\usepackage[europeanresistors,americaninductors]{circuitikz}
\usepackage{colortbl}
\usepackage{yfonts}
\usetikzlibrary{shapes,arrows}
\usetikzlibrary{positioning}
\usetikzlibrary{arrows,shapes}
\usetikzlibrary{intersections}
\usetikzlibrary{calc,patterns,decorations.pathmorphing,decorations.markings}
\usepackage[BoldFont,SlantFont,CJKchecksingle]{xeCJK}
\setCJKmainfont[BoldFont=Evermore Hei]{Evermore Kai}
\setCJKmonofont{Evermore Kai}
\usepackage{pst-node}
\usepackage{pst-plot}
\psset{unit=5mm}
\newcommand*\diff{\mathop{}\!\mathrm{d}}
\allowdisplaybreaks
\usepackage{polynom}
\mode<beamer>{\usetheme{Frankfurt}}
\mode<beamer>{\usecolortheme{dove}}
\mode<article>{\hypersetup{colorlinks=true,pdfborder={0 0 0}}}
\mode<beamer>{\AtBeginSection[]{\begin{frame}<beamer>\frametitle{Topic}\tableofcontents[currentsection]\end{frame}}}
\setbeamercovered{transparent}
\subtitle{系统的稳态误差计算}
\providecommand{\alert}[1]{\textbf{#1}}

\title{线性系统时域分析法}
\author{}
\date{}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs Org-mode version 7.9.3f}}

\begin{document}

\maketitle

\begin{frame}
\frametitle{Outline}
\setcounter{tocdepth}{3}
\tableofcontents
\end{frame}














\section{误差传递函数}
\label{sec-1}
\begin{frame}
\frametitle{系统误差}
\label{sec-1-1}
\begin{columns}
\begin{column}{0.5\textwidth}
%% ignore
\label{sec-1-1-1}

\begin{psmatrix}[rowsep=0.4,colsep=0.5]
%              
%         E(s) .------.
% R-->o----- ->| G(s) |--+--> C
%   _ ^        '------'  |
%     |                  |  
%     '--------[ H(s) ]--'
%
%
% 1                        2                        3             4              5    6
$R(s)$ &  \pscirclebox[framesep=-0.2em]{$\times$} &$\cdots $   &  \psframebox{$G(s)$}   &   & $C(s)$ \\
       &                                          &       &  \psframebox{$H(s)$}&  &        \\
%link
\ncline{->}{1,1}{1,2}
\ncline{->}{1,2}{1,4}
\naput{$E(s)$}
\ncline{->}{1,4}{1,6}
\ncangle[angleA=0,angleB=0,armA=0.5em,armB=0.5em]{1,4}{2,4}
\ncangle[angleA=180,angleB=-90,armA=0.5em,armB=1em]{->}{2,4}{1,2}
\naput[npos=2.3]{$-$}
\end{psmatrix}

\mode<article>{系统误差有两种:}

\begin{itemize}
\item <2->输入端定义:$E_{2}(s)=E(s)$
\item <3->输出端定义:$E_{1}(s)=C_{expect}-C_{real}$
\item <4->不加特别说明,系统误差指的是输入端定义.
\end{itemize}
\end{column}
\begin{column}{0.5\textwidth}
\begin{block}<5->{$E(s)$ 与 $E_1(s)$}
\label{sec-1-1-2}


\begin{eqnarray*}
C_{expect} & = & \frac{R(s)}{H(s)}\\
E_{1}(s)   & = & \frac{R(s)}{H(s)}-C(s) \\
           & = & \frac{R(s)-C(s)H(s)}{H(s)}\\
           & =& \frac{E(s)}{H(s)}
\end{eqnarray*}
\end{block}
\end{column}
\end{columns}
\end{frame}
\begin{frame}
\frametitle{误差传递函数:}
\label{sec-1-2}

\begin{eqnarray*}
\Phi_{e}(s) & = & \frac{E(s)}{R(s)}\\
            & = & \frac{1}{1+G(s)H(s)} \\
            & = & \frac{R(s)-H(s)C(s)}{R(s)} \\
            & = & 1-H(s)\Phi(s)
\end{eqnarray*}

\begin{itemize}
\item <2-> 系统误差:$E(s)=\Phi_{e}(s)R(s)$
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{稳态误差:}
\label{sec-1-3}

\begin{eqnarray*}
e_{ss} &=& \lim_{t\rightarrow \infty}e(t) \\
       &=& \lim_{s\rightarrow 0}sE(s)  \\
       &= & \lim_{s\rightarrow 0}s\Phi_{e}(s)R(s)
\end{eqnarray*}

\begin{itemize}
\item <2->稳态误差与输入信号有关
\item <3->求稳态误差前要判断系统稳定性
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{扰动作用下的稳态误差}
\label{sec-1-4}

\begin{psmatrix}[rowsep=0.4,colsep=0.5]
%          1    2  3     4    5    6    7 
%                            | N(s)
%               E(s)         v +  
%         R---->o--> G_1(s)--o- G_2(s)--+--> C
%             _ ^                       |
%               |                       |  
%               '-----------H(s)--------+
%           
%
% 1                         2                           3                  4                     5
       &                                       &               &                        &         $N(s)$                                  &   \\  
$R(s)$  &\pscirclebox[framesep=-0.2em]{$\times$}& {\hskip 1em} &  \psframebox{$G_1(s)$} &  \pscirclebox[framesep=-0.2em]{$\times$} &  \psframebox{$G_2(s)$}  & \    & $C(s)$ \\
       &                                         &              &     &   \psframebox{$ H(s) $} 
%link
\ncline{->}{1,5}{2,5}
%\naput{$N(s)$}
\ncline{->}{2,1}{2,2}
\ncline{->}{2,2}{2,4}
\naput{$E(s)$}
\ncline{->}{2,4}{2,5}
\ncline{->}{2,5}{2,6}
\ncline{->}{2,6}{2,8}
\ncangles[angleA=180,angleB=0,armA=0em,armB=0em]{->}{2,7}{3,5}
\ncangle[angleA=180,angleB=-90,armA=0em,armB=0em]{->}{3,5}{2,2}
\naput[npos=1.6]{$-$}
\end{psmatrix}
\begin{columns}
\begin{column}{0.5\textwidth}
\begin{block}<2->{输入端定义:}
\label{sec-1-4-1}


\begin{eqnarray*}
E(s) & = &E_R(s)+E_N(s) \\
E_R(s)&=& \Phi_e(s)R(s) \\
E_N(s)&=& \Phi_{en}(s)N(s) \\
\end{eqnarray*}
\end{block}
\end{column}
\begin{column}{0.5\textwidth}
\begin{block}<3->{输出端定义:}
\label{sec-1-4-2}

令 $R(s)=0$ ,计算 $N(s)$ 单独引起的 $e_{ss}$ ,此时 $C_{expect}(s)=0$ 

\begin{eqnarray*}
E(s) & = & 0-C(s) \\
     & = & -\Phi_N(s)N(s)\\
\Phi_N(s) &=& \frac{G_2}{1+G_1G_2}\\
e_{ss}&=&\lim_{s\rightarrow 0}s(-\Phi_N(s)N(s)) 
\end{eqnarray*}
\end{block}
\end{column}
\end{columns}
\end{frame}
\section{系统类型与静态误差系数}
\label{sec-2}
\begin{frame}
\frametitle{阶跃输入:}
\label{sec-2-1}

\begin{eqnarray*}
r(t) & = & A \\
R(s) & = & \frac{A}{s} \\
e_{ss}&=& \lim_{s\rightarrow 0}s \cdot\frac{1}{1+G_{open}(s)}\cdot\frac{A}{s} \\
      &=& \lim_{s\rightarrow 0}\frac{A}{1+G_{open}(s)}
\end{eqnarray*}
\end{frame}
\begin{frame}
\frametitle{速度输入}
\label{sec-2-2}

\begin{eqnarray*}
r(t) & = & vt \\
R(s) & = & \frac{v}{s^{2}} \\
e_{ss}&=& \lim_{s\rightarrow 0}s \cdot\frac{1}{1+G_{open}(s)}\cdot\frac{v}{s^{2}} \\
      &=& \lim_{s\rightarrow 0}\frac{A}{s+sG_{open}(s)}\\
      &=& \lim_{s\rightarrow 0}\frac{A}{sG_{open}(s)}
\end{eqnarray*}
\end{frame}
\begin{frame}
\frametitle{加速度输入}
\label{sec-2-3}

\begin{eqnarray*}
r(t) & = & \frac{1}{2}at^{2} \\
R(s) & = & \frac{a}{s^{2}} \\
e_{ss}&=& \lim_{s\rightarrow 0}s \cdot\frac{1}{1+G_{open}(s)}\cdot\frac{a}{s^{3}} \\
      &=& \lim_{s\rightarrow 0}\frac{A}{s^{2}+s^{2}G_{open}(s)}\\
      &=& \lim_{s\rightarrow 0}\frac{A}{s^{2}G_{open}(s)}
\end{eqnarray*}
\end{frame}
