controltheory/beamer/3/3_3_ess.org
** 零型系统($\nu=0$)
 * <2-> $r(t)=A$ 时:
     \begin{eqnarray*}
     K_p &=& \lim_{s\rightarrow 0}G_o(s) 
	 = \lim_{s\rightarrow 0}\frac{K\prod_{i=0}^m(\tau_i s+1)}{\prod_{j=1}^n (\tau_j s+1)} 
	 = K \\
     e_{ss1} &=& \frac{A}{1+K_p}
     \end{eqnarray*}
     \mode<article>{称为有差系统.}
 * <3-> $r(t)=vt$ 时:
     \begin{eqnarray*}
     K_v &=& \lim_{s\rightarrow 0}sG_o(s) 
	 = 0 \\
     e_{ss2} &=& \infty 
     \end{eqnarray*}
 * <4> $r(t)=\frac{1}{2}at^2$ 时:
     \begin{eqnarray*}
     K_a &=& \lim_{s\rightarrow 0}s^2 G_o(s) 
	 = 0 \\
     e_{ss3} &=& \infty
     \end{eqnarray*}

** I型系统($\nu=1$)
 *  <2->$r(t)=A$ 时:
     \begin{eqnarray*}
     K_p &=& \lim_{s\rightarrow 0}G_o(s) 
	 = \lim_{s\rightarrow 0}\frac{K\prod_{i=0}^m(\tau_i s+1)}{s\prod_{j=1}^{n-1}(\tau_j s+1)} 
	 = \infty \\
     e_{ss1} &=& \frac{1}{1+K_p}
	   = 0
     \end{eqnarray*}
     \mode<article>{无差系统.}
 *  <3->$r(t)=vt$ 时:
     \begin{eqnarray*}
     K_v &=& \lim_{s\rightarrow 0}sG_o(s) 
	 = K \\
     e_{ss2} &=& \frac{v}{K_v} 
	     =\frac{v}{K}
     \end{eqnarray*}
 *  <4->$r(t)=\frac{1}{2}at^2$ 时:
     \begin{eqnarray*}
     K_a &=& \lim_{s\rightarrow 0}s^2 G_o(s) 
	 = 0 \\
     e_{ss3} &=& \infty
     \end{eqnarray*}
** II型系统($\nu=2$)
\begin{eqnarray*}
K_p & = & \infty\\
e_{ss1} &=& 0 \\
K_v & = & \infty \\
e_{ss2} &=& 0 \\
K_a &=& K \\
e_{ss3} &=& \frac{a}{K}
\end{eqnarray*}
** 小结:
 * <2->零型:
     \[e_{ss1}=\frac{A}{1+K},e_{ss2}=e_{ss3}=\infty\]
 * <3->I型:
     \[e_{ss1}=0,e_{ss2}=\frac{v}{K},e_{ss3}=\infty\]
 * <4->II型:
     \[e_{ss1}=e_{ss2}=0,e_{ss3}=\frac{a}{K}\]
** 例:

若 $G(s)H(s) =\frac{10K_h}{s+1},K_h\in\{0.1,1\}$ ,求单位阶跃下的 $e_{ss}$ .

\mode<article>{解:}

*** 解法1						      :BMCOL:B_block:
     :PROPERTIES:
     :BEAMER_col: 0.45
     :BEAMER_env: block
     :BEAMER_envargs: <2->
     :END:

零型系统, $r(t)=1,e_{ss}=\frac{1}{1+K_p}$

\begin{eqnarray*}
K_p &=  &\lim_{s\rightarrow 0}G(s)H(s) \\
    &=& 10K_h \\
    &=&
\begin{cases}
1  & K_h =0.1 \\
10 & K_h = 1
\end{cases}\\
e_{ss} &=&
\begin{cases}
0.5 & K_h=0.1 \\
\frac{1}{11} & K_h=1
\end{cases}
\end{eqnarray*}

*** 解法2:						      :BMCOL:B_block:
     :PROPERTIES:
     :BEAMER_col: 0.45
     :BEAMER_env: block
     :BEAMER_envargs: <3->
     :END:

\begin{eqnarray*}
e_{ss} &=& \lim_{s\rightarrow 0}s\Phi_e(s)R(s)\\
    &=&\lim_{s\rightarrow 0}s\frac{1}{1+G(s)H(s)}R(s)\\
    &=&\lim_{s\rightarrow 0}s\frac{s+1}{s+1+10K_h}\frac{1}{s}\\
    &=& \frac{1}{1+10K_h} \\
    &=&
\begin{cases}
0.5 & K_h=0.1 \\
\frac{1}{11} & K_h=1
\end{cases}
\end{eqnarray*}

** 例:  求 $r(t)=2+3t$ 时的 $e_{ss}$
\begin{psmatrix}[rowsep=0.4,colsep=0.5]
% 1    2   3  4   5   6    7       8   9
%           R*    E(s)    .------.
% R-->2/s+1-->o------>o-->| G(s) |--+--> C
%           _ ^     _ ^   '------'  |
%             |       |             |  
%             |       '----0.8s-----+
%             |                     |
%             '---------------------'
%        
%
% 1                        2                 3        
$R(s)$ &  \psframebox{$\frac{2}{s+1}$} & ${\hskip 1em}  $ & %
\pscirclebox[framesep=-0.2em]{$\times$} &$ $   & \pscirclebox[framesep=-0.2em]{$\times$} & %
\psframebox{$\frac{5}{s(5s+1)}$}   & \   & $C(s)$ \\
  &   &     &  & & & \psframebox{$ 0.8s $} &  \ &  \\
\\
%link
\ncline{->}{1,1}{1,2}
\ncline{->}{1,2}{1,4}
\naput{$R^{*}(s)$}
\ncline{->}{1,4}{1,6}
\naput{$E(s)$}
\ncline{->}{1,6}{1,7}
\ncline{->}{1,7}{1,9}
\ncline{2,8}{2,7}
\ncangle[angleA=180,angleB=-90,armA=0.5em,armB=1em]{->}{2,7}{1,6}
\naput[npos=2.3]{$-$}
\ncangles[angleA=180,angleB=-90,armA=0em,armB=4.5em]{->}{1,8}{1,4}
\naput[npos=3.6]{$-$}
\end{psmatrix}

解:

\begin{eqnarray*}
G(s) & = \frac{C(s)}{E(s)} \\
     &=& \frac{\frac{5}{s(5s+1)}}{1+\frac{4s}{s(5s+1)}} \\
    & = & \frac{5}{5s^2+5s} \\
    & = & \frac{1}{s(s+1)} 
\end{eqnarray*}

** 例:计算稳态误差
\mode<article>{判断稳定性:}

\begin{eqnarray*}
\Phi(s) &=& \frac{C(s)}{R^{*}(s)}
        = \frac{1}{s(s+1)+1} \\
\Phi_e(s) &=& \frac{s(s+1)}{s(s+1)+1}
\end{eqnarray*}
系统稳定.

\begin{eqnarray*}
R(s) &=& \frac{2s+3}{s^2}\\
e_{ss} & = &\lim_{s\rightarrow 0}s\Phi_e(s)R^{*}(s) \\
       &=& \lim_{s\rightarrow 0}s\cdot\frac{s(s+1)}{s(s+1)+1}\cdot\frac{2}{s+1}\cdot\frac{2s+3}{s^2} \\
       &=& 6
\end{eqnarray*}

* 动态误差系数
** 动态误差系数
动态误差系数可描述系统稳态误差随时间变化的规律，静态误差可看作动态误差的一个特例.

\begin{eqnarray*}
E(s) & = & \Phi_e(s)R(s)\\
\Phi_e(s) &=& \frac{E(s)}{R(s)}\\
         &=&\frac{1}{1+G(s)H(s)} \\
         &=& \frac{M(s)}{N(s)} 
\end{eqnarray*}

** 在 $s=0$ 处展开,得:

\begin{eqnarray*}
\phi_e(s)  &=& \Phi_e(0)+\dot{\Phi}_e(0)s+\cdots+\frac{\Phi_e^{(n)}(0)s^n}{n!}+\cdots \\
E(s) & = & \Phi_e(0)R(s)+\dot{\Phi}_e(0)sR(s)+\cdots+\frac{\Phi_e^{(n)}(0)s^nR(s)}{n!}+\cdots \\
e_{ss}(t) & = & \Phi_e(0)r(t)+\dot{\Phi}_e(0)\dot{r}(t)+\cdots+\frac{\Phi_e^{(n)}(0)r^{(n)}(t)}{n!}+\cdots \\
          &= & \sum_{i=1}^{\infty}C_ir^{(i)}(t) ,\qquad
C_i = \frac{\Phi_e^{(i)}(0)}{i!}
\end{eqnarray*}

  * 其中 $C_i$ 称为动态误差系数.
      * $C_0$ 动态位置误差系数
      * $C_1$ 动态速度误差系数
      * $C_2$ 动态加速度误差系数

** 动态误差系数示例:
  * <2-> 零型系统 $r(t)=1$ 则 \[e_{ss}(t)=C_0 ,C_0=\frac{1}{1+K_p}\]
  * <3-> I型系统 $r(t)=t$ 则 \[e_{ss}(t)=C_0 t+C_1,C_0=0,C_1=\frac{1}{K_v}\]
  * <4-> II型系统 $r(t)=t$ 则 \[e_{ss}(t)=C_0 \frac{1}{2}at^2+C_1at+C_2 a,C_0=C_1=0,C_2=\frac{1}{K_a}\]

** 讨论: $C_i$ 的计算
\begin{eqnarray*}
\Phi_e(s) &=& \frac{M(s)}{N(s)} \\
 & = & C_0+C_1s+C_2s^2+\cdots
\end{eqnarray*}

** 例: $G(s)H(s)=\frac{1}{s(s+1)}$

# 依次除以 $s$,并取极限.
# \begin{eqnarray*}
# \Phi_e(s) & = & \frac{s^2+s}{s^2+s+1} \\
# C_0 &=& \lim_{s\rightarrow 0}\Phi_e(s) 
#     = \lim_{s\rightarrow 0}\frac{s^2+s}{s^2+s+1} 
#     = 0 \\
# C_1 &=& \lim_{s\rightarrow 0}\frac{\Phi_e(s)-C_0}{s} 
#     = \lim_{s\rightarrow 0}\frac{s^2+s}{s(s^2+s+1)} 
#     = 1 \\
# C_2 &=& \lim_{s\rightarrow 0}\frac{\Phi_e(s)-C_0-C_1 s}{s^2} 
#     = \lim_{s\rightarrow 0}\frac{-s^3}{s^2(s^2+s+1)}
#     = 0 \\
# C_3 &=& \lim_{s\rightarrow 0}\frac{\Phi_e(s)-C_0-C_1 s-C_2 s^2}{s^3}
#     = \lim_{s\rightarrow 0}\frac{-s^3}{s^2+s+1}
#      = -1 
# \end{eqnarray*}
# 
# ** 综合除法
# *** 综合除法:
综合除法:

\[
\begin{matrix}
\text{divident}      &      &   \text{divisor}  &    & \text{quotient} &   & \text{remainder} \\  
s^2+s             &\div  &    s^2+s+1     & \rightarrow &  s       &  & s^2+s-s(1+s+s^2) \\
-s^3             &\div  &   s^2+s+1       & \rightarrow  & -s^3     &   & -s^3-(-s^3)(1+s+s^2)\\
 s^4+s^5         &\div  &  s^ 2+s+1       & \rightarrow & s^4  &   & \cdots  \\
\cdots           &\div   &  s^2+s+1       &\rightarrow  & \cdots   &    &\cdots   
\end{matrix}
\]

得:
\begin{eqnarray*}
\Phi_e(s)  &=& s-s^3+s^4+\cdots
\end{eqnarray*}

** 例: $G(s)H(s)=\frac{1}{s(s+1)}$ 另一种写法:

\begin{eqnarray*}
\frac{s^2+s}{s^2+s+1} & = & s + \frac{-s^2+s-s(1+s+s^2)}{s^2+s+1}  \\
\frac{-s^3}{s^2+s+1}  & = & -s^3+\frac{-s^3-(-s^3)(1+s+s^2)}{s^2+s+1}\\
\frac{s^4+s^5}{s^2+s+1} &=& s^4 +\cdots \\
\cdots                  &=& \cdots \\
\Phi_e(s)               &=& s-s^3+s^4+\cdots
\end{eqnarray*}

