controltheory/beamer/3/3_3_ess.org
** 例: $G(s)H(s)=\frac{1}{s(s+1)}$ 长除法
# \polylongdiv{s^2+s}{s^2+s+1}
\[ 
\begin{array}{ccccccccc} 
 & & s &  & -s^3 & +s^4 &  &\cdots\\
\cline{2-8}
\multicolumn{1}{r|}{1+s+s^2} & & s & +s^2 \\
                             & & s  & +s^2 & +s^3 \\
\cline{3-5}
                             & &   &     & -s^3 \\
                             & &   &     & -s^3  & -s^4 & -s^5\\
\cline{5-7}
                             & &   &     &       &  s^4 &  +s^5\\
                             & &   &     &       &  s^4 &  +s^5  & +s^6\\
\cline{6-8}
                             & &   &     &       &      &       & -s^6\\
                             & &   &     &       &      &       & \cdots
\end{array} 
\]


** 例:
单位负反馈系统开环传递函数: $G_o(s)=\frac{100}{s(0.s1+1)}$ 求输入信号为 $\sin(5 t)$ 时的稳态误差.

解:系统稳定,
\begin{eqnarray*}
r(t) &=& sin(\omega t),\omega=5 \\
E(s) &=& \Phi_e(s)R(s) \\
e_{ss}&=& \sum_{i=0}^{\infty}C_i r^{(i)} \\
\Phi_e(s)&=& \frac{1}{1+G_o(s)} \\
         &=& \frac{0.1s^2+s}{0.1s^2+s+100} 
\end{eqnarray*}

** 解法1


# %\begin{matrix}
# %0.1s^2+s            & \div & 0.1s^2+s+100  & \rightarrow &  0.01s   & 0.1s^2+s-0.01s(0.1s^2+s+100) \\
# %-10^{-3}s^3+0.09s^2 & \div & 0.1s^2+s+100  & \rightarrow &  9\times 10^{-4}s^2 & -10^{-3}s^3+0.09s^2-9\times 10^{-4}s^2(0.1s^2+s+100) \\
# %-9\times 10^{-5}s^4-1.9\times 10^{-3}s^3 & \div & 0.1s^2+s+100  & \rightarrow & -1.9\times 10^{-5}s^3  & \cdots \\
# %\end{matrix}


 *  $\frac{0.1s^2+s}{0.1s^2+s+100}  =0.01s+\frac{0.1s^2+s-0.01s(0.1s^2+s+100)}{0.1s^2+s+100}$
 *  $\frac{-10^{-3}s^3+0.09s^2}{0.1s^2+s+100} = 9\times 10^{-4}s^2+\frac{-10^{-3}s^3+0.09s^2-9\times 10^{-4}s^2(0.1s^2+s+100)}{0.1s^2+s+100}$
 *  $\frac{-9\times 10^{-5}s^4-1.9\times 10^{-3}s^3}{0.1s^2+s+100}  = -1.9\times 10^{-5}s^3 + \cdots$
所以
  * $\Phi_e(s) = 0+0.01s+9\times 10^{-4}s^2-1.9\times 10^{-5}s^3+\cdots$
  * $e_{ss}(t) = (C_0-C_2\omega^2+C_4\omega^4+\cdots)\sin(\omega t)+(C_1-C_3\omega^3+C_5\omega^5+\cdots)\cos(\omega t)$
  * $e_{ss}(t) = -0.055\cos(5t-249^{\circ})$

** 解法2:
\begin{eqnarray*}
E(s) & = & \Phi_e(s)R(s) \\
     &=& \frac{s^2+10S}{s^2+10S+1000}\cdot\frac{5}{s^2+25}\\
     &=&\frac{-0.0498s-0.1115}{s^2+25}+\frac{as+b}{s^2+10s+1000}\\
e_{ss}(t)&=& -0.055\cos(5t-249^{\circ})+\Delta 
\end{eqnarray*}
其中: $\lim_{t\rightarrow\infty}\Delta = 0$


* 减小稳态误差的措施
** 减小 $e_{ss}$ 的措施
 * <2->增大开环增益
 * <3->提高系统类型
 * <4->串级控制抑制扰动
 * <5->复合控制
** 增大开环增益
\begin{align*}
G(s)    & = \frac{K\prod_{i=1}^{m}(\tau_{i}s+1)}{s^{\nu}\prod_{j=1}^{n-\nu}(T_{j}s+1)} \\
e_{ss}  &=
\begin{cases}
\frac{1}{1+K} & \nu=0,R(s)=\frac{1}{s} \\
\frac{1}{K} & \nu=1,R(s)=\frac{1}{s^2} \\
\frac{1}{K} & \nu=2,R(s)=\frac{1}{s^3} 
\end{cases}
\end{align*}
** 提高系统类型
\begin{align*}
G(s)    & = \frac{1}{s}\frac{K\prod_{i=1}^{m}(\tau_{i}s+1)}{s^{\nu}\prod_{j=1}^{n-\nu}(T_{j}s+1)} \\
e_{ss}  &=
\begin{cases}
\frac{1}{K} & \nu=0,R(s)=\frac{1}{s^2} \\
\frac{1}{K} & \nu=1,R(s)=\frac{1}{s^3} 
\end{cases}
\end{align*}
** 串级控制
\begin{psmatrix}[rowsep=0.4,colsep=0.5]
%          1    2  3     4    5    6    7 
%                            | N(s)
%               E(s)         v +  
%         R---->o-o-> G_1(s)--o- G_2(s)---G_3-+--> C
%             _ ^  \________H(s)________/     |
%               |                             |  
%               '-----------------------------+
%           
%
       &         &            &         &                        & $N(s)$    \\  
$R(s)$ & $\circ$ & \hskip 1em & $\circ$ &  \psframebox{$G_1(s)$} & $\circ$   &  \psframebox{$G_2(s)$} & \  & \psframebox{$G_3(s)$} & \  & $C(s)$ \\
       &         &            &         &                        &   \psframebox{$ H(s) $} 
%link
\ncline{->}{1,6}{2,6}
%naput{$N(s)$}
\ncline{->}{2,1}{2,2}
\ncline{->}{2,2}{2,4}
\naput{$E(s)$}
\ncline{->}{2,4}{2,5}
\ncline{->}{2,5}{2,6}
\ncline{->}{2,6}{2,7}
\ncline{->}{2,7}{2,9}
\ncline{->}{2,9}{2,11}
\ncangle[angleA=-90,angleB=0,armA=0em,armB=0em]{->}{2,8}{3,6}
\ncangle[angleA=180,angleB=-90,armA=0em,armB=0em]{->}{3,6}{2,4}
\naput[npos=1.6]{$-$}
\ncangles[angleA=-90,angleB=-90,armA=4em,armB=0em]{->}{2,10}{2,2}
\naput[npos=2.6]{$-$}
\end{psmatrix}


\begin{align*}
C(s) &=(G_1(s)E'(s)+N(s))G_2(s)G_3(s) \\
E'(s) &=E(s)-\frac{H(s)}{G_3(s)}C(s)\\
C(s) &=\frac{(G_1(s)E(s)+N(s))G_2(s)G_3(s)}{1+G_1(s)G_2(s)H(s)}\\
C(s) &\approx\frac{G_3(s)E(s)}{H(s)} \qquad (G_1(s)>>1) \\
\end{align*}
** 复合控制
\begin{psmatrix}[rowsep=0.4,colsep=0.5]
%   .-e/(1-e)-.         
%   |  E(s)   |   .------.
% R-->o-------o ->| G(s) |--+--> C
%   _ ^           '------'  |
%     |                     |  
%     '---------------------'
%
%
% 1          2         3          4                  5          6        7
       &          & \psframebox{$\frac{\epsilon}{1-\epsilon}$} \\
$R(s)$ &  $\circ$ & \hskip 1em & $\circ$  &  \psframebox{$G(s)$} & \  & $C(s)$ 
%link
\ncline{->}{2,1}{2,2}
\ncline{->}{2,2}{2,4}
\naput[labelsep=0pt]{$E(s)$}
\ncline{->}{2,4}{2,5}
\ncline{->}{2,5}{2,7}
\ncangles[angleA=0,angleB=180,armA=0.2em,armB=0.5em]{->}{2,1}{1,3}
\ncangle[angleA=0,angleB=90,armA=0em,armB=0.5em]{->}{1,3}{2,4}
\ncangles[angleA=-90,angleB=-90,armA=2em,armB=0em]{->}{2,6}{2,2}
\naput[npos=2.3]{$-$}
\end{psmatrix}


\begin{eqnarray*}
\epsilon &=& \frac{r(\infty)-c(\infty)}{r(\infty)}\\
c(\infty)&=& (1-\epsilon)r(\infty)\\
r(t)&=&\frac{r'(t)}{1-\epsilon}\\
c(\infty) &=& r'(\infty) \\
e'_{ss}&=&r'(\infty)-c(\infty)\\
 &=& 0
\end{eqnarray*}
